Hello,

Same problem is present on "[aws_ec2_transit_gateway_route_table_association](https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/ec2_transit_gateway_route_table_association)" resource.

```
  # module.env.aws_ec2_transit_gateway_route_table_association.peering-centipede-association-to-dx-connect-gateway-example will be created
  + resource "aws_ec2_transit_gateway_route_table_association" "peering-example-association-to-dx-connect-gateway-example" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX"
      + transit_gateway_route_table_id = "tgw-rtb-XXXXXXXXXXXXXXXXX"
    }
```

```
Error: error associating EC2 Transit Gateway Route Table (tgw-rtb-XXXXXXXXXXXXXXXXX) association (XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX): InvalidTransitGatewayAttachmentID.Malformed: Invalid Transit Gateway Attachment id XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX.
	status code: 400, request id: XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX

  on modules/tgw.tf line 34, in resource "aws_ec2_transit_gateway_route_table_association" "eering-centipede-association-to-dx-connect-gateway-example":
  34: resource "aws_ec2_transit_gateway_route_table_association" "eering-centipede-association-to-dx-connect-gateway-example" {
```

Regards,